//3. Підрахувати кількість слів у реченні.

#include <string>	//Бібліотека для рооти з рядками
#include <iostream>
using namespace std;

int main()
{
	string r;
	cout << "Enter some text " << endl;	//Просимо ввести кор. рядок з символів
	getline(cin, r);		//ввiд рядка
	int size = r.size();		//вичисляємо розмір рядка
	int k = 0;	//Зміна для к-ість пробілів
	for (int i = 0; i < size; i++)//запускаємо цикл для первірки кожного елементу 
	{
		if (r[i] == ' ') { //при умові що даний елемент пробіл
			k++; //доюавляємо одиницю для рахування пробілів.
		}
	}
	cout << "Words = " << k + 1; //Виводимо на екран к-сть слів
}
	